my_cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "sex" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["sex", "F"], ["description", "fresca is named after the soda, i had a soda in my hand when i got fresca."], ["updated_at", "2022-07-01 20:33:24.002847"], ["id", 1]]
---
  def update
    @cat = Cat.find(params[:id])
    if @cat.update(cat_params)